/*1) ¬вести матрицю д≥йсних чисел розм≥ром mxn ~
2) ¬идрукувати вс≥ елементи в фомат≥ матриц≥~
3) видрукувати стовпчики матриц≥ з непарними номерами 
4) видрукувати вс≥ д≥агональн≥ елементи 
5) знайти ≥ видрукувати найменший елемент в кожному р€дку
6) пом≥н€ти м≥сц€ми значенн€ k - ого та l - ого р€дка(k, l вводимо) 
7) порахувати ск≥льки Ї таких стовпц≥в, в  €ких елементи спадають*/

#include <iostream>
using namespace std;
int main()
{
	const int m = 3;
	const int n = 3;
	double mas[m][n];
	//1
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << "enter el.[" << i << "][" << j << "]" << endl;
			cin >> mas[i][j];
			cout << endl;
		}
	}
	//2
	for (int i = 0; i < m; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << mas[i][j] << " ";
		}
		cout << endl;
	}






	return 0;

}